[
    {
      "Flower_Name": "Aster",
      "Flower_Story & Origins": "The Aster is a unique daisy-like wildflower that’s known for its star-shaped flower head. Aster meanings include love and wisdom. With a rich history in Greek mythology, it’s said that the aster was created by the tears of the Greek goddess, Astraea. One day, she was so upset by how few stars there were in the dark sky, that she began to cry. As she wept, her tears fell to the ground and turned into star-shaped aster flowers. Thus, the flower was named after her, with aster meaning star. Another interpretation is that asters were created when Virgo scattered stardust over the Earth. Where the stardust settled, aster flowers bloomed. The aster is also an emblem of Venus, the goddess of love.",
      "Flower_Meanings": "The aster flower carries a variety of meanings, but in general, the flower mainly represents love, wisdom, and faith. In Victorian culture, the aster represents daintiness, patience, and charm.The aster is the official birth flower for the month of September.When burnt, the odor emitted by the asters is known to ward off serpents.",
      "Flower_Symbolism_Colors": "Purple asters symbolize wisdom and royalty and are the most popular color.White asters symbolize purity and innocence.Red asters symbolize undying devotion.Pink asters symbolize sensitivity and love.",
      "Flower_Cultural_Significance": "Renowned American poet, Robert Frost, is known for his poetic descriptions of rural life. In his famous poem “A Late Walk” he describes a solitary walk through a somber landscape.In the end, he refers to the aster flower as an emblem of hope.I end not far from my going forth.By picking the faded blue.Of the last remaining aster flower.To carry again to you.",
      "Flower_Facts": "Asters are known as being drought resistant and are great for desert landscaping.Bushy aster species have seeds that are shaped like parachutes and travel by way of wind.There are over 600 species included within the Aster genus, which shares the same family as the daisy.Asters are composite flowers, meaning that they are made of a central core of many tiny flowers surrounded by long petals.",
      "Flower_Uses": "In Chinese culture, the aster is used as a medicinal herb that’s effective for treating a wide variety of ailments, from hangovers to epilepsy. When brewed as a tea, asters can aid in digestion as well.The aster is also used as a holistic remedy for various respiratory ailments such as coughs, lung deficiencies, and asthma. It is effective as a decongestant for the lungs, especially during cold and flu season. This medicinal herb can also be quite effective as a relaxant by increasing blood circulation.Would you like to see more varieties of this playful wildflower? Check out our bouquets that feature various types of asters, including Matsumoto and Monte Cristo asters!",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Bird of Paradise",
      "Flower_Story & Origins": "The bird of paradise flower meaning includes joy and paradise, as it is the quintessential tropical flower. It originates from South Africa, where it is also nicknamed the Crane Flower. This flower has been grown at the Royal Botanic Gardens in Kew, South Africa since 1773. The scientific name for the bird of paradise is Strelitzia reginae, which was named by Sir Joseph Banks, who was the director of the royal gardens. He named genus, Strelitzia, after Queen Charlotte who was the Duchess of Mecklenburg-Strelitz.The bird of paradise gets its name from the fact that its flower is made of three bright orange petals and three blue petals which are fused together into a single bud. As the flower blooms, each petal makes its debut and the resulting shape mirrors that of a tropical bird in flight.",
      "Flower_Meanings": "Bird of paradise meanings include joyfulness and paradise, as well as anticipation and excitement.The bird of paradise represents faithfulness, love, and thoughtfulness — making it the perfect romantic gift. In Hawaii, the bird of paradise grows wild and is a significant part of the culture. In Hawaiian, the name means “Little Globe” and represents magnificence.The bird of paradise is the official flower for a ninth wedding anniversary. Birds of paradise also represent having a good perspective on life.",
      "Flower_Symbolism_Colors": "The bird of paradise is known as the ultimate symbol of paradise and freedom. Due to its tropical nature, this flower also symbolizes freedom and joy. Although birds of paradise are best known for their bright orange and blue colors, their flowers can also be white.",
      "Flower_Cultural_Significance": "The bird of paradise is a very popular source of inspiration in fine art. Famous floral artist, Georgia O’Keefe, painted White Bird of Paradise during her time spent in Hawaii in the 1940s, and it is one of her most famous paintings from that time.The Bird of Paradise was a play that came out in 1912 about a torn interracial romance between a Polynesian beauty and a young American sailor. The play popularized Hawaiian culture and was adapted for film in 1932.",
      "Flower_Facts": "The bird of paradise is closely related to the banana plant, which is evident in its similar-looking large fan-like leaves.The giant bird of paradise, Strelitzia nicolai, is one of the largest species and can grow up to 30 feet in height.In the wild, birds of paradise flowers are pollinated by sunbirds, regularly feed on its sweet nectar. When the bird lands on its petals, the pollen is transferred to the bird’s chest, which gets transferred to the next flower the bird lands on.After cutting, the bird of paradise flower can last for one to two weeks.Due to its toxicity, keep the bird of paradise flower away from dogs and cats.",
      "Flower_Uses": "With a bloom time that ranges from March to October, birds of paradise flowers are popular cut flowers, especially for summer floral arrangements. They are a great way to add a color and exoticism to any bouquet or centerpiece and are popular in weddings.The bird of paradise is an easy flower to grow in gardens where the climate is warm. They also make great plants to grow in greenhouses and sunrooms due to their preference for humidity. Potting the plant in  a container is also beneficial for flowering.Dreaming about the tropics? Take a look at our tropical flower bouquets that include other exotic flowers such as colorful orchids paired with classic blooms such as roses and lilies.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Calla Lily",
      "Flower_Story & Origins": "The calla lily was named after the Greek word for beautiful — calla. It is associated with the Greek goddess Hera. According to the legend Zeus brought Hercules, his son from another woman, to Hera, his wife, while she was asleep to drink her milk. When she woke up she pushed him away and drops of milk flew across the sky to create the milky way. The ones that fell on the ground grew into beautiful lilies.When Venus, goddess of love, beauty, and desire, saw the lilies she was jealous of their beauty. She cursed their beauty by placing a large yellow pistil in the middle of the flowers. Because of this story, some associate the calla lily with Venus and thus with lust and sexuality. However, the most common meaning for calla lilies is purity, holiness, and faithfulness. It’s commonly depicted in images of the Virgin Mary. Calla lilies are also symbols for rebirth and resurrection, tied to the resurrection of Jesus in part because they bloom around Easter and in part because they are shaped like trumpets which symbolize triumph.",
      "Flower_Meanings": "Though calla lilies are most commonly white, they actually grow in a variety of colors including pink, purple, yellow, and even black. Calla lily’s symbolism varies by flower color. White calla lilies symbolize purity and innocence.Pink calla lilies symbolize appreciation and admiration.Purple calla lilies symbolize charm and passion.Yellow calla lilies symbolize gratitude.",
      "Flower_Symbolism_Colors": "Because of their beauty, calla lilies are used for many occasions including weddings and funerals. Calla lilies’ versatility is perfectly expressed by Katharine Hepburn in the movie Stage Door.“The calla lilies are in bloom again. Such a strange flower — suitable to any occasion. I carried them on my wedding day, and now I place them here in the memory of something that has died.”",
      "Flower_Cultural_Significance": "The calla lily’s name is actually a misnomer as it is not a true calla or a true lily. The Swedish botanist Carolus Lunnaeus made an error naming the plant. The error was eventually corrected when German botanist Karl Koch created the genus Zantedeschia, but the common name for the flower has stuck.",
      "Flower_Facts": "The flower is native to Africa and consists of a spathe, the outer part of the flower, and the spadix, the yellow spike in the center. The spathe is actually a modified leaf rather than a petal. Calla lilies are known for their hardiness and can even grow in water and survive frost.",
      "Flower_Uses": "The calla lily is the 6th wedding anniversary flower, symbolizing the beauty of a couple’s love.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Chrysanthemum",
      "Flower_Story & Origins": "The first chrysanthemums were cultivated in China centuries ago. It has appeared in ancient Chinese writings as early as 15th century BC and was used as an herbal remedy. Its boiled roots were believed to provide headache relief, and the sprouts and petals were eaten in salads. The Chinese city of Chu-Hsien was named after the chrysanthemum and literally means “Chrysanthemum City.” From China, the chrysanthemum made its way over to Japan by Buddhist monks in AD 400. Soon after its introduction, the Japanese were so enamored by this beautiful flower that it was soon adopted as the emperor’s crest and official seal. “Kiku” is the Japanese name for chrysanthemum and every year there is a National Chrysanthemum Day which is also referred to as the Festival of Happiness.In the 17th century, the chrysanthemum was introduced to Europe where Karl Linnaeus, the father of modern taxonomy, coined the Western name “chrysanthemum.” The name is derived from the Greek words “chrysos” meaning gold, and “anthemon” meaning flower. Today they are also commonly referred to as “mums.”",
      "Flower_Meanings": "Since the flower blooms in the fall, the chrysanthemum signifies joy and beauty despite the oncoming winter. Although beautiful, chrysanthemums hold various meanings across different time periods and cultures, both positive and negative.Victorians used chrysanthemums to show friendship and well-wishing.Buddhists use the chrysanthemum as offerings due to their powerful Yang energy. In China, the chrysanthemum is traditionally offered to the elderly as they symbolize long life as well as good luck in the home. In Australia, chrysanthemums are the official flower for Mother’s Day due to their nickname “mums.” In Belgium and Austria, the chrysanthemum is used almost exclusively as a memorial flower to honor loved ones and is the flower of choice for placing on graves.",
      "Flower_Symbolism_Colors": "Chrysanthemums generally symbolize longevity, fidelity, joy and optimism. Various colors symbolize other important meanings as well.Red chrysanthemums symbolize love and deep passion.Yellow chrysanthemums symbolize neglected love or sorrow.White chrysanthemums symbolize loyalty and honesty.Violet chrysanthemums symbolize a wish to get well.",
      "Flower_Cultural_Significance": "Since the chrysanthemum was first cultivated in China, the flower still holds deep cultural significance to this day, especially in art. The chrysanthemum is one of the Four Gentlemen, which also includes the plum blossom, the orchid, and bamboo. These are the four main plants depicted in traditional Chinese watercolor paintings, and are derived from Confucianism.In Japan, the official seal for the Imperial family is a chrysanthemum with 16 petals and is used for official government documents. In the military, the Supreme Order of the Chrysanthemum is the most prestigious honor that can be awarded by the Emperor.",
      "Flower_Facts": "The chrysanthemum is the official birth flower of November.\nIn the United States, the chrysanthemum is the largest commercially produced flower and is known as the “Queen of Fall Flowers.” The chrysanthemum head is actually a cluster of many small flower heads.The chrysanthemum belongs to the Asteraceae family which is the largest family of flowering plants and includes over 23,000 species.",
      "Flower_Uses": "Chrysanthemums have long been used for their medicinal properties. Drinking chrysanthemum flower tea and taking chrysanthemum vitamins or supplements can provide a multitude of health benefits. These benefits include: treating chest pain, reducing high blood pressure, treating diabetes, reducing fever, being an anti-inflammatory agent, and alleviating headaches.In addition to medicine, the chrysanthemum is used in as an essential ingredient in Chinese cooking. The leaves are used as greens in many sautéed dishes, soups, and salads and the delicate petals are brewed into tea.In the United States, the yellow and orange varieties are the most popular bedding plants used in landscaping.Chrysanthemum cinerariaefolium is used as a powerful ingredient in insecticides. The active ingredient found in the flower heads is called pyrethrum, and is a toxic compound that causes paralysis in insects.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Freesia",
      "Flower_Story & Origins": "The freesia flower originated in South Africa, and belongs to the Iris family which includes approximately 14 freesia species. This flower got its name when the botanist, Christian P. Ecklon, named the flower after Friedrich H.T. Freese, a fellow botanist, as a commemoration of their friendship. Freesia meanings include friendship, trust, and innocence, among various other meanings. Due to their delicate fragrance, freesias are one of the most popular flowers in the world. However, they are very difficult to grow in domestic gardens and their petals are extremely delicate. They are popular as cut flowers and are often a florist’s favorite for bouquets and centerpieces.\n\nFreesia flowers are similar to gladioli in that the flowers grow from a central stalk that has sword-shaped leaves. The flowers are funnel-shaped and their stalks can grow up to one foot in height.",
      "Flower_Meanings": "Freesia flower meanings generally include friendship, trust, thoughtfulness and innocence. They are a popular gift for friends and family, and is a popular flower amongst various cultures.According to the Victorian language of flowers, the freesia is the ultimate flower of trust.\nIn the United States, the freesia is the official flower to commemorate a couple’s seventh wedding anniversary.\nIn numerology, freesias signify the number nine, which signifies selflessness and obligation.Since the 1950s, freesias have been widely used as wedding flowers because they represent both the purity of the bride as well as the trust between the couple.",
      "Flower_Symbolism_Colors": "Due to their popularity, freesias have been widely cross-bred. Today there are over 1,400 species of cultivars ranging in color from red, white, and yellow, to purple and pink. Freesias of all colors generally symbolize trust and innocence, but there are several freesia colors that carry specific meanings. White freesias symbolize purity and innocence. They are one of the most popular wedding flowers because they are symbolic of the purity of the bride as well as the trust between the couple.Multicolored freesia bouquets symbolize friendship and thoughtfulness. They make great gifts for family, friends, and even co-workers.Pink freesias symbolize motherly love.Yellow freesias symbolize joy, renewal, and friendship.Red freesias symbolize passion.",
      "Flower_Cultural_Significance": "Robert Henry Forster, a famous English poet, refers to the freesia’s sweet fragrance in his poem “The Greenhouse in Early April.” In the poem, he describes the abundance of colorful blooms in his well-stocked greenhouse just as winter is fading and spring is approaching.Fragrance the newly opened Freesia sheds.From its white trumpets with the splash of gold;",
      "Flower_Facts": "Freesia flowers can either be single or double petaled, and grow in a Y-shape.Although non-poisonous, the sap from a freesia can cause irritation for people who have sensitive skin.\nThe “Ballerina” freesia is named for its shape, which looks like the silhouette of a ballerina dancer.\nFreesia plants are zygomorphic, which means that their flowers only grow on one side of the stalk.",
      "Flower_Uses": "Since freesias are best grown in humid and subtropical climates, they are difficult to grow in domestic gardens in the United States. Thus, they are primarily used as cut flowers and can last at least a week in a vase.The freesia flower is known for its fragrance, which has many applications and uses. Freesias are widely used in aromatherapy as a means for stress relief. Placing a bouquet of freesias in your home or office can have a significant impact on your mood and reduce your stress levels. Since the fragrance from freesias is so pleasantly sweet, the species Freesia refracta is widely cultivated as a fragrance for use in shampoos, body lotions, and perfumes. In fact, many of the most popular designer perfumes today include the freesia scent to balance out the overall fragrance.It’s easy to see why the freesia is one of the most popular flowers in the world. Their sweet fragrance and variety of colors make them the perfect gift for showing your friends and family that you are thinking about them.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Heather",
      "Flower_Story & Origins": "The heather flower’s meaning comes from its genus name, Calluna, which stems from the Greek word kalluno, and means to cleanse or adorn. This is appropriate, as heather plants were once used for making brooms.Heather flowers commonly grow in northern and western Europe, Turkey, and Morocco, and have been naturalized in parts of North America. It is especially popular in Scotland. The name heather is believed to come from the Scottish word haeddre, which was used to describe a heathland, or a shrubland habitat.According to a Scottish legend, Malvina, daughter of a Celtic bard, was engaged to a warrior named Oscar. Oscar was killed in battle, and the messenger that delivered the news gave her heather as a token of Oscar’s love. As her tears fell on the heather, it turned white. Though she was sad, she wished happiness on others and hoped that anyone who found white heather would have good luck.",
      "Flower_Meanings": "Heather flowers commonly mean good luck, admiration, and protection.Queen Victoria popularized the meaning of heather as good luck in England because of her appreciation for Scottish lore and traditions. Victorians may also have associated heather with good luck because of its scarcity at the time, much like we consider four-leaf clovers good luck.In the sixteenth century, Clan Ranald, a Scottish clan, believed that they won a battle because they wore white heather in their bonnets, which gave them both luck and protection.In Scotland, it is common to include a sprig of white heather in a bride’s bouquet for good luck.",
      "Flower_Symbolism_Colors": "Heather flowers typically grow in shades of white, purple, and pink.White heather symbolizes protection, good luck, or wishes coming true.Purple heather symbolizes admiration and solitude.",
      "Flower_Cultural_Significance": "Robert Louis Stevenson, a Scottish writer and poet, write a poem entitled Heather Ale. This poem tells the tale of Vikings and the Pictish King. According to the poem, the Vikings defeated the Picts army and cornered the king and his son on a cliff in an attempt to gain the recipe for Heather Ale. However, the king would rather be thrown off the cliff than give up the recipe. He loses the battle, but takes the secret recipe to his grave.This poem depicts not only the importance of heather to Scotland, but how it grew beautifully and bountifully in many areas.There stood the son and father,And they looked high and low;The heather was red around them,The sea rumbled below.",
      "Flower_Facts": "Heathers are evergreen shrubs.\nThey typically bloom from July to September.Each small heather flower can have up to thirty seeds.Heathers do best in full sun with acidic, well-draining soil.",
      "Flower_Uses": "There are records dating back to the seventh century of heather’s healing properties. In the sixteenth century, German doctor Paulus Aegineta noted that the flowers, leaves, and stems healed various types of sores, both internal and external. Nicolas Alexandre, a Benedictine monk, also noted that heather tea could dissolve kidney stones. Today, heather is still used by some to aid in urinary tract and digestive conditions, among other things.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Hydrangea",
      "Flower_Story & Origins": "Throughout history the hydrangea has been especially significant in Japan, where many believe the flower originated. According to a Japanese legend, the hydrangea became associated with heartfelt emotion, gratitude for understanding, and apology after a Japanese emperor gave them to the family of the girl he loved to make up for neglecting her in favor of business and show how much he cared about her. Pink hydrangeas are especially associated with genuine emotion because their shape resembles a beating heart.",
      "Flower_Meanings": "The hydrangea has a wide range of meanings, from heartfelt emotion to gratitude to boastfulness. Each meaning stems from different cultural beliefs and stories.Because of the Japanese legend above, hydrangeas are associated with an apology.Victorians considered hydrangeas a negative plant and used it to represent boastfulness, bragging, or vanity.Hydrangeas became associated with boastfulness and vanity because they produce magnificent flowers, but very few seeds. They were also given to people who turned down love interests as signs that they were cold or frigid.",
      "Flower_Symbolism_Colors": "Hydrangeas commonly come in shades of pink, blue, purple, and green. The hydrangea symbolism for each color is as follows:Pink hydrangeas symbolize heartfelt emotion.Blue hydrangeas symbolize frigidity and apology.White hydrangeas symbolize boasting or bragging.Purple hydrangeas symbolize a desire to deeply understand someone.",
      "Flower_Cultural_Significance": "Hydrangeas have inspired many artists and writers alike. In her book Tar Baby, Toni Morrison praises the flower’s beauty saying, “A dead hydrangea is as intricate and lovely as one in bloom.”",
      "Flower_Facts": "The greatest diversity of hydrangea species exists in eastern Asia, which includes Japan, China, and Korea.The color of hydrangeas, except for white hydrangeas, depends on the acidity of the soil. You can make pink hydrangeas turn blue by increasing the acidity of your soil. You can increase the acidity by adding coffee grounds, citrus peels, and crushed eggshells.Hydrangea flowers bloom in a variety of different formations. The most popular are the mophead hydrangeas, whose flowers grow in big ball-shaped clusters. Lacecap hydrangeas, which grow well in shade, have clusters of tiny blooms accented by larger blooms. Panicle hydrangeas, which grow well in cold, have flowers that grow in cone-shaped clusters.The name hydrangea comes from the Greek words hydros, meaning water, and angos, meaning jar, which is fitting because these plants require a lot of water. However, too much water can kill them. Signs of overwatering include wilting, yellowing leaves, leaves falling off, and stunted growth.Hydrangeas are often given on 4th wedding anniversaries to symbolize appreciation and heartfelt emotion.",
      "Flower_Uses": "Though the leaves of hydrangeas are poisonous if ingested because they contain cyanogenic glycosides, which release hydrogen cyanide when chewed, the roots are used for medicinal purposes. Hydrangea root can be used as an antioxidant and is also used to treat kidney problems. Because of their many meanings, hydrangeas are great for many different occasions including heartfelt moments, apologies, and thanks.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Iris",
      "Flower_Story & Origins": "The iris is represented in Greek mythology. Iris was the goddess of the rainbow and a messenger for Zeus and Hera, and many believe that the flower is named after her. She carried messages from heaven to earth on the arc of the rainbow, and was a companion to female souls on the way to heaven. To this day, Greeks plant purple irises on women’s graves so that Iris will guide them to their resting place in heaven.",
      "Flower_Meanings": "The iris commonly means wisdom, hope, trust, and valor. It can be found in a variety of temperate zones around the world, as such, its meanings have been adapted to fit various cultures.During the 16th century BC, irises were introduced to Egypt from Syria, and stylized versions of these flowers began to decorate the scepters of pharaohs as representations of victory and power.The iris inspired the fleur-de-lis, a decorative symbol used by French royalty. It originated in the Middle Ages. During this time the fleur-de-lis became tied to the French Monarchy, and appeared on their coat of arms, coins, and shields. Some believe that the three petals represented the three social orders: nobility, clergy, and peasants.",
      "Flower_Symbolism_Colors": "Associating irises to the goddess of the rainbow, like the Ancient Greeks did, is fitting because there are over 200 species of irises that come in a wide variety of colors. Specific iris symbolism depends on the flower color:Purple irises symbolize royalty and wisdom.Yellow irises symbolize passion.Blue irises symbolize faith and hope.White irises symbolize purity.",
      "Flower_Cultural_Significance": "The beauty of irises inspired many artists. One of the most notable works on irises is Van Gogh’s Irises. In this piece, he carefully studied the flowers to capture their unique twisting and curving lines.",
      "Flower_Facts": "The iris is the state flower of Tennessee, and is also the February birth flower and the 25th wedding anniversary flower.Most iris varieties bloom in early summer. Irises have three large outer petals called falls, and three inner upright petals called standards.",
      "Flower_Uses": "Around the nineteenth century, especially in Italy, orris roots, the roots of germanica and pallida species, became an integral part of the perfume industry. These roots, when left out to dry, develop a violet-like scent, which improves over time. Because of its pleasant smell, orris roots were used in many cosmetics until people noticed that it caused allergic reactions. Today, the roots are often used in potpourris and sachets.Orris roots were also used for medicinal purposes as an antiseptic, anti-inflammatory, and for teeth and skin health.With its great diversity of colors and meanings, irises are great gifts for all types of people in your life. You can give purple irises to a parent or mentor, yellow irises to a significant other, and blue irises to someone who needs a little extra encouragement.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "",
      "Flower_Story & Origins": "Lilacs have a deep-rooted history originating in ancient Greek mythology. It was said that Pan, the god of forests and fields was hopelessly in love with a nymph named Syringa. One day he was pursuing her through a forest and, afraid of his advances, she turned herself into a lilac shrub to disguise herself. To Pan’s surprise, he could not find Syringa, but he did find the shrub. Because a lilac shrub consists of hollow reeds, he cut the reeds and created the first pan pipe. The scientific name for lilac is Syringa vulgaris, and the name is derived from the Greek word “syrinks” which means pipe.The common name, lilac, was borrowed from the French and Spanish word of the same name. Similarly, the Arabic word for this flower is “lilak”. The word lilac refers to the light purple color of its flowers.",
      "Flower_Meanings": "The meaning of the lilac flower has diversified throughout the ages. Lilacs originated in Southeastern Europe and are a popular part of the Mediterranean culture. They are frequently associated with the Easter holiday, which occurs during the peak of its bloom time.Lilac meanings vary throughout different cultures and time periods.The Celtics regarded the lilac as “magical” due to their incredibly intoxicating fragrance.\nDuring the Victorian Age, the giving of a lilac was meant to be a reminder of an old love. In fact, widows were often seen wearing lilacs during this period.In Russia, holding a sprig of lilac over the newborn would bring wisdom.In the United States, the lilac is the official state flower of New Hampshire and represents the ‘hardy’ nature of its people.",
      "Flower_Symbolism_Colors": "Because lilacs have one of the earliest bloom times, they symbolize spring and renewal. Lilacs also symbolize confidence, which makes them a traditionally popular gift for graduates. There are many meanings that lilacs have that can best be classified by color.White lilacs symbolize purity and innocence.Violet lilacs symbolize spirituality.Blue lilacs symbolize happiness and tranquility.\nMagenta lilacs symbolize love and passion.Lilac, the color for which this flower is named, is a light purple that symbolizes a first love.Although various colors of lilacs have different meanings, the lilac has always had a strong association with love and romance throughout history.",
      "Flower_Cultural_Significance": "Lilacs have been a source of inspiration for artists throughout history. Impressionists Vincent Van Gogh and Claude Monet both have famous works depicting the beauty of lilacs in their paintings. American poet Walt Whitman, uses the lilac in his famous poem, “When Lilacs Last in the Door-yard Bloom’d”, as a symbol of life after death in a narrative depicting Abraham Lincoln’s last days",
      "Flower_Facts": "The lilac is the official flower of a couple’s 8th wedding anniversary.Lilacs have one of the shortest bloom times and only flower for three weeks at the beginning of spring.Both George Washington and Thomas Jefferson had an affinity for lilacs and grew them in their gardens.Lilacs belong to the same family as the olive tree.",
      "Flower_Uses": "Due to their pleasant fragrance, lilacs have become a popular ingredient in perfumes and cosmetics. When used as an essential oil, they have been known to treat skin disorders, combat bacterial and fungal infections, prevent stomach disorders, and act as a fever reducer. In aromatherapy, lilacs can help fight depression and increase relaxation.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Orchid",
      "Flower_Story & Origins": "The name orchid is derived from the Greek word “orkhis”. This exotic flower was named by an ancient Greek botanist named Theophrastos who thought that the fleshy underground tubers resembled the male anatomy.There are many types of orchids, with over 20,000 species in the world. One of the most popular orchids is the moth orchid, which got its name from the fact that their flowers were first mistaken as moths when they were first discovered by Swedish naturalist, Peter Osbeck.\n\n",
      "Flower_Meanings": "Due to their namesake, orchids are associated with fertility, virility, and sexuality. These associations, coupled with their exotic appearance, have given them a long history of being associated with love, fertility and elegance throughout various cultures and time periods.One of the major orchid genera is Paphiopedilum. The name is derived from the word “Paphos” which is the name of the temple where the Greek goddess of love, Aphrodite, was worshiped.In Ancient Greece, it was believed that parents could choose the sex of their child by eating the orchid’s tubers. If the father ate thick, fleshier tubers, the child would turn out to be a male. If the mother ate smaller, thinner tubers, the child would turn out to be a female.Aztecs commonly mixed vanilla, a type of orchid, with chocolate to create an elixir that brought on power and strength.During the Victorian age, orchids were only found in the tropics and were extremely rare. Therefore, Victorians would collect exotic orchids as a sign of luxury and refined taste. When given as a gift, the more rare the orchid, the deeper your love and passion was for the receiver. In China, orchids are regarded as emblems of integrity, elegance and friendship.",
      "Flower_Symbolism_Colors": "Although orchids have a reputation for being symbols of fertility and elegance, different colored orchids have a diverse range of symbolisms.White orchids symbolize innocence and purity, as well as elegance and reverence.Pink orchids symbolize femininity, grace, and joy.Yellow orchids symbolize friendship and new beginnings. They make great gifts for a friend to celebrate an accomplishment.\nPurple orchids symbolize royalty and admiration, and are traditionally given as a sign of respect.\nOrange orchids symbolize pride, enthusiasm, and boldness.\n",
      "Flower_Cultural_Significance": "Confucius admired the orchid and wrote many poems regarding the exotic flower and compared them to the character of noble scholars. Orchids were the topic of many of his philosophical and literary works, and formed the basis of his moral teachings.“The orchids grow in the woods and they let out their fragrance even if there is no one around to appreciate it. Likewise, men of noble character will not let poverty deter their will to be guided by high principles and morals.” –Confucius",
      "Flower_Facts": "The pink orchid is the traditional flower of a couple’s 14th and 25th wedding anniversary.\nOrchids rely on symbiotic relationships with fungi to survive, which makes them highly adaptable to a wide variety of ecosystems.Orchids have origins in every continent with the exception of Antarctica.\nThe world’s smallest orchid grows to be only 2 mm wide, and its flowers are only a single-cell thick.\nThe slipper orchid has a unique method of pollination. It lures the pollinator, an insect, into its slippery pouch. The only escape for the victim is to crawl through a very narrow crevice within the plant, forcing it to rub against the attached pollen. When the insect falls victim to another slipper orchid, cross-pollination occurs through the same process.",
      "Flower_Uses": "Orchids are known for their fragrance and are widely used in perfumes and aromatherapy. Vanilla extract, a commonly used flavor enhancer in sweets and baked goods, is actually derived from the Vanilla orchid plant.The orchid has medicinal applications as well. In China, the orchid has been cultivated for thousands of years, and is used as a natural remedy for coughs, diseases of the kidney, lung, stomach and eye.Orchids are also believed to be powerful aphrodisiacs, and many cultures including Greece and China eat the bulbs for this purpose.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Rose",
      "Flower_Story & Origins": "In Greek mythology, roses originated from Adonis, the deity of plants and rebirth. Adonis was born from a deceptive union between King Theias and his daughter Myrrha. When King Theias realized that his daughter had tricked him, he chased her with his sword. To protect Myrrha, Aphrodite transformed her into a tree. King Theias shot the tree with an arrow, splitting it in half. It was from this tree that Adonis was born. Aphrodite took to Adonis and raised him like a son. As Adonis grew, he became an avid hunter. One day while he was hunting, Adonis came across Ares, one of Aphrodite’s past lovers, who was disguised as a wild boar. Ares attacked Adonis and when Aphrodite heard his screams, she ran into the forest and found him dying. The blood that ran from his wounds hit the ground and turned into roses.In another version of the tale, red roses originated when Aphrodite was running to Adonis’ side, cut her feet on the thorns of the flowers, and stained them red.",
      "Flower_Meanings": "Roses are most commonly associated with love and romance.Roses can also mean secrecy or confidentiality. The term “sub rosa”, meaning under the rose, comes from ancient times. Romans would hang roses from the ceilings of banquet halls, and it was understood that anything said under the influence of wine was to remain confidential.In the Middle Ages, roses were also hung from the ceilings of meeting rooms. It was understood that everyone under the roses was sworn to secrecy.Roses are also used on four tarot cards. The Fool, the Magician, the Strength card, and the Death card. On the Fool, the white rose symbolizes purity and is a reminder to cleanse the mind. On the Magician card, it signifies unfolding wisdom. On the Strength card, the rose represents balance. And on the Death card, it’s a reminder of purity, clarity, and transparency of intent.\n",
      "Flower_Symbolism_Colors": "A rose’s symbolism varies by the color of the rose and how many roses are given.Red roses symbolize love and romance and are the perfect Valentine’s Day rose.Pink roses symbolize gratitude, grace, admiration, and joy.Orange roses symbolize enthusiasm and passion.Yellow roses symbolize friendship.White roses symbolize innocence and purity.Though in most cases, roses are tied to love, you can send a specific romantic message by the number of roses you send.One rose symbolizes love at first sight.Two roses symbolize shared and deep love.Three roses says “I love you”.\nSix roses says “I want to be yours”.Seven roses says “I’m infatuated with you”.Nine roses symbolize eternal love.Ten roses says “You’re perfect”.",
      "Flower_Cultural_Significance": "Roses are England’s national flower. In the fifteenth century, they represented two important families — the Lancasters and the Yorks. The War of the Roses occurred in England between 1455 and 1487 when the house of Lancaster, represented by a red rose, and the house of York, represented by a white rose, competed with each other to rule England.The rose also inspired one of England’s greatest writers, William Shakespeare. His play, Romeo and Juliet, contains one of the most popular quotes on roses. In the play, Juliet says, “A rose by any other name would smell as sweet.” She’s reminding Romeo that even though they come from rival houses, it shouldn’t matter because their love is real.\n\n",
      "Flower_Facts": "There are many types of roses — 150 species and thousands of hybrids can be found in a variety of shapes and colors.All roses are considered shrubs.There are three groups of roses: old roses, modern roses, and species roses.Rose petals can be eaten and can be used in salads or desserts.",
      "Flower_Uses": "Because of their sweet fragrance, roses are commonly used in perfume and beauty products. Rosewater has anti-inflammatory properties that can help soothe irritation. It also includes antioxidants and can hydrate your skin. Rose hips, the fruit of roses, are also beneficial for you. They can be eaten and contain high amounts of Vitamin C.",
      "Flower_Image": ""
    },
    {
      "Flower_Name": "Sunflower",
      "Flower_Story & Origins": "The sunflower’s name comes from its tendency to reposition itself to face the sun. It’s genus, Helianthus, is rooted in two Greek words — “helios” meaning sun and “anthos” meaning flower.The ancient Greek myth of Apollo and Clytie is one explanation of why sunflowers turn towards the sun. In this story Clytie, a nymph, adored Apollo. At first, he loved her back, but soon he fell in love with Leucothoe. Because of her jealousy, Clytie told Leucothoe’s father of the relationship and he punished her by burying her alive.In anger, Apollo turned her into a flower, but even in flower form she still loved him and would spend her days watching him as he moved the sun across the sky in his chariot, just like sunflowers move to face the sun.\n\n",
      "Flower_Meanings": "Because of the myth of Clytie and Apollo, the sunflower most commonly means adoration and loyalty. However, sunflower meanings can vary across cultures.In China, people associate sunflowers with long life, good fortune, and vitality.To Native American groups, sunflowers represented harvest, bounty, and provision because they provided seeds, pigment, and more.",
      "Flower_Symbolism_Colors": "The sunflower’s yellow color symbolizes vitality, intelligence, and happiness. The color yellow also traditionally symbolizes friendship.Sunflowers also symbolize worship and faithfulness in various religions because of their resemblance to the sun, which is associated with spiritual knowledge and the desire to seek light and truth.The Incas used sunflowers to symbolize the Sun God, and brought them to temples for worship. The priestesses also wore sunflowers on their garments and as crowns.",
      "Flower_Cultural_Significance": "Sunflowers have also been used by countless artists. The most well-known portrayal of sunflowers is Van Gogh’s Sunflower series, which includes Vase With Twelve Sunflowers, Two Cut Sunflowers, and Four Cut Sunflowers. Ai WeiWei was also inspired by the flowers in his Sunflower Seeds exhibit, an installation of millions of porcelain seeds handcrafted by specialists working in small-scale workshops in China, symbolizing the relationship between the individual and the masses.Authors and other influential figures have used sunflower symbolism to inspire them too, causing them to write encouraging words like:Keep your face to the sunshine and you cannot see the shadows. It’s what the sunflowers do. – Helen Keller\nEvery friend is to the other a sun, and a sunflower also. He attracts and follows. – Jean Paul Light-enchanted sunflower, thou/ Who gazest ever true and tender/ On the sun’s revolving splendour. – Pedro Calderon de la Barca",
      "Flower_Facts": "Sunflowers are often given on 3rd year wedding anniversaries as signs of adoration, loyalty, and strength.Sunflowers typically bloom in the summer.Many sunflowers are heat and drought tolerant, making them easy plants to grow.\n\n",
      "Flower_Uses": "The sunflower has been used throughout history in many different ways. Sunflowers were originally cultivated by Native Americans, and used for food and medicine. Medicinal uses included using the juice from the stems to treat wounds and infusing the plant in water to treat kidneys and chest pains. Though sunflowers aren’t typically used medicinally anymore, they are still grown for agricultural purposes. The two main types of sunflower varieties grown are the oil seed type, which has small black seeds, and the non-oil type, which has larger seeds with a thicker hull. Sunflower oil is used for cooking and in beauty products, and its health benefits include improved heart health and lower cholesterol.Whether you’re simply trying to brighten someone’s day, or you want to show how much you adore them, the vibrant, fun nature of sunflowers make them a great choice.",
      "Flower_Image": ""
    }
  ]
